


Network Working Group                                        S. Bhandari
Internet-Draft                                             S. Gundavelli
Intended status: Standards Track                           Cisco Systems
Expires: April 30, 2015                                      J. Korhonen
                                                          Renesas Mobile
                                                              M. Grayson
                                                           Cisco Systems
                                                        October 27, 2014


                Access Network Identifier Option in DHCP
              draft-ietf-dhc-access-network-identifier-04

Abstract

   This document specifies the format and mechanism that is to be used
   for encoding access network identifiers in DHCPv4 and DHCPv6 messages
   by defining new access network identifier options and sub-options.

Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC2119].

Status of this Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on April 30, 2015.

Copyright Notice

   Copyright (c) 2014 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal



Bhandari, et al.         Expires April 30, 2015                 [Page 1]

Internet-Draft      ANI Options for DHCPv4 and DHCPv6       October 2014


   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3
   2.  Motivation . . . . . . . . . . . . . . . . . . . . . . . . . .  3
   3.  Terminology  . . . . . . . . . . . . . . . . . . . . . . . . .  4
   4.  DHCPv4 Access-Network-Identifier Option  . . . . . . . . . . .  5
     4.1.  DHCPv4 Access-Network-Identifier sub-options . . . . . . .  5
     4.2.  DHCPv4 Access-Technology-Type sub-option . . . . . . . . .  6
     4.3.  DHCPv4 Network-Identifier sub-options  . . . . . . . . . .  7
       4.3.1.  DHCPv4 Network name sub-option . . . . . . . . . . . .  7
       4.3.2.  DHCPv4 Access-Point name sub-option  . . . . . . . . .  8
       4.3.3.  DHCPv4 Access-Point BSSID sub-option . . . . . . . . .  9
     4.4.  DHCPv4 Operator identifier sub-options . . . . . . . . . .  9
       4.4.1.  DHCPv4 Operator Enterprise ID sub-option . . . . . . .  9
       4.4.2.  DHCPv4 Operator Realm sub-option . . . . . . . . . . . 10
   5.  DHCPv6 Access-Network-Identifier options . . . . . . . . . . . 10
     5.1.  DHCPv6 Access-Network-Type option  . . . . . . . . . . . . 11
     5.2.  DHCPv6 Network-Identifier options  . . . . . . . . . . . . 12
       5.2.1.  DHCPv6 Network Name option . . . . . . . . . . . . . . 12
       5.2.2.  DHCPv6 Access-Point Name option  . . . . . . . . . . . 12
       5.2.3.  DHCPv6 Access-Point BSSID option . . . . . . . . . . . 13
     5.3.  Operator identifier options  . . . . . . . . . . . . . . . 13
       5.3.1.  Operator Enterprise ID option  . . . . . . . . . . . . 13
       5.3.2.  Operator Realm option  . . . . . . . . . . . . . . . . 14
   6.  Client Behavior  . . . . . . . . . . . . . . . . . . . . . . . 15
   7.  Relay Agent Behavior . . . . . . . . . . . . . . . . . . . . . 15
   8.  Server Behavior  . . . . . . . . . . . . . . . . . . . . . . . 15
   9.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 16
   10. Security Considerations  . . . . . . . . . . . . . . . . . . . 17
   11. Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 18
   12. References . . . . . . . . . . . . . . . . . . . . . . . . . . 18
     12.1. Normative References . . . . . . . . . . . . . . . . . . . 18
     12.2. Informative References . . . . . . . . . . . . . . . . . . 18
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 19







Bhandari, et al.         Expires April 30, 2015                 [Page 2]

Internet-Draft      ANI Options for DHCPv4 and DHCPv6       October 2014


1.  Introduction

   Access network identification of a network device has a range of
   applications.  For example the local mobility anchor in a Proxy
   Mobile IPv6 domain is able to provide access network and access
   operator specific handling or policing of the mobile node traffic
   using information about the access network to which the mobile node
   is attached.

   This document specifies Dynamic Host Configuration Protocol v4
   (DHCPv4) [RFC2131] and Dynamic Host Configuration Protocol for IPv6
   (DHCPv6) [RFC3315] options for access network identification that is
   added by Client or Relay agent in the DHCPv4 or DHCPv6 messages
   towards the Server.

   Dynamic Host Configuration Protocol (DHCP) client or DHCP relay agent
   aware of the access network and access operator add this information
   in the DHCP messages.  This information can be used to provide
   differentiated services and policing of traffic based on the access
   network to which a client is attached.  Examples of how this
   information can be used in mobile networks can be found in .
   [RFC6757].


2.  Motivation

   Proxy mobile IPv6 [RFC5213] can be used for supporting network-based
   mobility management in various types of network deployments.  The
   network architectures, such as Service provider Wi-Fi access
   aggregation or, WLAN integrated mobile packet core are examples where
   Proxy Mobile IPv6 is a component of the overall architecture.  Some
   of these architectures require the ability of the local mobility
   anchor (LMA) [RFC5213] to provide differentiated services and
   policing of traffic to the mobile nodes based on the access network
   to which they are attached.  Policy systems in mobility architectures
   such as PCC [TS23203] and ANDSF [TS23402] in 3GPP system allow
   configuration of policy rules with conditions based on the access
   network information.  For example, the service treatment for the
   mobile node's traffic may be different when they are attached to a
   access network owned by the home operator than when owned by a
   roaming partner.  The service treatment can also be different based
   on the configured Service Set Identifiers (SSID) in case of IEEE
   802.11 based access networks.  Other examples of services include the
   operator's ability to apply tariff based on the location.

   The PMIPv6 extension as specified in [RFC6757] defines PMIPv6 options
   to carry access network identifiers in PMIPv6 signaling from Mobile
   Access Gateway (MAG) to LMA.  MAG can learn this information from



Bhandari, et al.         Expires April 30, 2015                 [Page 3]

Internet-Draft      ANI Options for DHCPv4 and DHCPv6       October 2014


   DHCP options as inserted by DHCP client or Relay agent before MAG.
   If MAG relays DHCP messages to LMA as specified in [RFC5844] this
   information can be inserted by MAG towards LMA in the forwarded DHCP
   messages.

   Figure 1 illustrates an example Proxy Mobile IPv6 deployment where
   Access Points (AP) acting as a DHCP relay agent inserts access
   network identifiers in DHCP messages relayed from the connected
   clients.  The mobile access gateway learns this information over DHCP
   and delivers the information elements related to the access network
   to the local mobility anchor over Proxy Mobile IPv6 signaling
   messages.  In this example, the additional information could comprise
   the SSID of the used IEEE 802.11 network and the identities of the
   operators running the IEEE 802.11 access network infrastructure.

          SSID: IETF-1
          Operator-Id: provider1.example
          +--+ DHCP
          |AP|-------.                        {Access Specific Policies)
          +--+       |             _-----_             |
                   +-----+       _(       )_        +-----+
                   | MAG |-=====(   PMIPv6  )======-| LMA |-
                   +-----+       (_ Tunnel_)        +-----+
          +--+ DHCP  |             '-----'
          |AP|-------'
          +--+
          SSID: IETF-2
          Operator-Id: provider2.example


                      Access Networks attached to MAG


3.  Terminology

   All the DHCP related terms used in this document are to be
   interpreted as defined in the Dynamic Host Configuration Protocol
   (DHCPv4) [RFC2131] and Dynamic Host Configuration Protocol for IPv6
   (DHCPv6) [RFC3315] specifications.  DHCP message refers to both
   DHCPv4 and DHCPv6 messages throughout this document.

   All the mobility related terms used in this document are to be
   interpreted as defined in the Proxy Mobile IPv6 specifications
   [RFC5213] and [RFC5844].  Additionally, this document uses the
   following abbreviations:

   Service Set Identifier Service Set Identifier (SSID)




Bhandari, et al.         Expires April 30, 2015                 [Page 4]

Internet-Draft      ANI Options for DHCPv4 and DHCPv6       October 2014


      Service Set Identifier Service Set Identifier (SSID) identifies
      the name of the IEEE 802.11 network.  SSID differentiates from one
      network to the other.

   Vendor ID

      The Vendor ID is the SMI Network Management Private Enterprise
      Code of the IANA-maintained Private Enterprise Numbers registry
      [SMI].


4.  DHCPv4 Access-Network-Identifier Option

   Access network identifier option carries information to identify the
   access network to which the client is attached.  This information
   includes access technology type, network identifier and access-
   network operator identifiers.

   The format of the DHCPv4 Access-Network-Identifier option is shown
   below.



    Code    Len          ANI Sub-options
   +------+------+------+------+------+--   --+-----+
   | code |  len |  s1  |  s2  |  s2  |  ...  |  sn |
   +------+------+------+------+------+--   --+-----+



   code (8-bits)
      8-bit code carrying Access Network Identifier sub-options, Added
      by client: OPTION_ACCESS_NETWORK_ID <IANA-0> To be assigned by
      IANA.

   len (8-bits)
      Total length of the included sub-options

   Client inserts Access Network Identifier option that contains one or
   more suboptions, as defined in Section 4.1.  Relay agent that wants
   to include Access Network Indentifer information includes one or more
   sub-options (see Section 4.1) in Relay Agent Information option
   [RFC3046].

4.1.  DHCPv4 Access-Network-Identifier sub-options

   Access network identifier information will be defined in multiple
   sub-options.



Bhandari, et al.         Expires April 30, 2015                 [Page 5]

Internet-Draft      ANI Options for DHCPv4 and DHCPv6       October 2014


   ANI Sub-options: The ANI Sub-options consists of a sequence of
   SubOptCode/Length/Value tuples for each sub-option, encoded in the
   following manner:



    SubOpt   Len     Sub-option Value
    +------+------+------+------+------+------+--...-+------+
    | code |   N  |  s1  |  s2  |  s3  |  s4  |      |  sN  |
    +------+------+------+------+------+------+--...-+------+

   ANI Sub-options are defined in following sections.

   (postamble)

   The initial assignment of DHCP access network identifier Sub-options
   is as follows:



   +================+========================================+
   | SUBOPTION CODE |      SUBOPTION  DESCRIPTION            |
   +================+========================================+
   |    <IANA-1>    | Access Technology Type Suboption       |
   +=========================================================+
   |    <IANA-2>    | Access Network Name Suboption          |
   +=========================================================+
   |    <IANA-3>    | Access Point Name Suboption            |
   +=========================================================+
   |    <IANA-4>    | Access Point BSSID Sub-option          |
   +=========================================================+
   |    <IANA-5>    | Operator-Identifier Sub-option         |
   +=========================================================+
   |    <IANA-6>    | Operator-Realm Sub-option              |
   +=========================================================+


4.2.  DHCPv4 Access-Technology-Type sub-option

   This sub-option is used for exchanging the type of the access
   technology of the network to which the client is attached.  Its
   format is as follows:




       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1



Bhandari, et al.         Expires April 30, 2015                 [Page 6]

Internet-Draft      ANI Options for DHCPv4 and DHCPv6       October 2014


      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      | suboption-code|   Length      |      ATT      |   Reserved    |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   suboption code (8 bits)
      8-bit code, it should be set to value of <IANA-1> ;, indicating
      that its a Access-Network-Type sub-option.

   Length (1 octet)
      8-bit unsigned integer indicating the length of this suboption in
      octets, excluding the suboption-code and length fields.  This
      field must be set to a value of (1).

   Access-Technology-Type (ATT)
      An 8-bit field that specifies the access technology through which
      the client is connected to the access link.  The values is as
      populated from the IANA name space Access Technology Type Option
      type value registry defined in [RFC5213].

4.3.  DHCPv4 Network-Identifier sub-options

   These sub-options are used for carrying the name of the access
   network (e.g., a SSID in case of IEEE 802.11 Access Network, or PLMN
   Identifier [TS23003] in case of 3GPP access ) and Access Point name,
   to which the client is attached.  The format of these sub-options is
   defined the following sections.

4.3.1.  DHCPv4 Network name sub-option


       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |SubOption Code |   Length      |                               ~
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                     Network Name (e.g., SSID or PLMNID)       ~
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   SubOption Code (8 bits)
      8-bit code, it should be set to value of <IANA-2> , indicating
      that its a Network-Name sub-option

   Length (8-bits)
      8-bit indicating Total length of this sub option, excluding the
      suboption code and length fields.  The value can be in the range
      of 2 to 32 octets.



Bhandari, et al.         Expires April 30, 2015                 [Page 7]

Internet-Draft      ANI Options for DHCPv4 and DHCPv6       October 2014


   Network Name (Variable Length)
      The name of the access network to which the mobile node is
      attached.  The type of the Network Name is dependent on the access
      technology to which the mobile node is attached.  If it is 802.11
      access, the Network Name MUST be the SSID of the network.  If the
      access network is 3GPP access, the Network Name is the PLMN
      Identifier of the network.  If the access network is 3GPP2 access,
      the Network Name is the Access Network Identifier [ANI].

      When encoding the PLMN Identifier, both the Mobile Network Code
      (MNC) [TS23003] and Mobile Country Code (MCC) [TS23003] MUST be 3
      digits.  If the MNC in use only has 2 digits, then it MUST be
      preceded with a '0'.  Encoding MUST be UTF-8.

4.3.2.  DHCPv4 Access-Point name sub-option



       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |suboption code |   Length      |                               ~
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                        Access-Point Name                      ~
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   subOption code (8 bits)
      8-bit code, it should be set to value of <IANA-3> , indicating
      that its a Access-Point Name sub-option

   Length (1 octet)
      8-bit indicating Total length of this sub option, excluding the
      suboption code and length fields.  The value can be in the range
      of 2 to 32 octets.

   Access-Point Name
      The name of the access point (physical device name) to which the
      mobile node is attached.  This is the identifier that uniquely
      identifies the access point.  While Network Name (e.g., SSID)
      identifies the operator's access network, Access-Point Name
      identifies a specific network device in the network to which the
      mobile node is attached.  In some deployments, the Access-Point
      Name can be set to the Media Access Control (MAC) address of the
      device or some unique identifier that can be used by the policy
      systems in the operator network to unambiguously identify the
      device.  The string is carried in UTF-8 representation.




Bhandari, et al.         Expires April 30, 2015                 [Page 8]

Internet-Draft      ANI Options for DHCPv4 and DHCPv6       October 2014


4.3.3.  DHCPv4 Access-Point BSSID sub-option



       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |suboption code |   Length(6)      |                            ~
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      ~                        Access-Point BSSID                     |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   suboption code (8 bits)
      8-bit code, it should be set to value of <IANA-4> , indicating
      that its a Access-Point BSSID sub-option.

   Length (1 octet)
      8-bit indicating Total length of this sub option, excluding the
      suboption code and length fields.  The value is set to 6.

   Access-Point BSSID
      The 48-bit Basic service set identification(BSSID) of the access
      point to which the mobile node is attached.

4.4.  DHCPv4 Operator identifier sub-options

   The Operator identifier sub-options can be used for carrying the
   operator identifier of the access network to which the client is
   attached.  The format of these sub-options is defined below.

4.4.1.  DHCPv4 Operator Enterprise ID sub-option


       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      | SubOption Code|     Length    |                               ~
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      ~      Operator Enterprise ID   |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   SubOption Code (1-Octet)
      8 bit code, It should be set to value of <IANA-5> , indicating
      that it is Operator-Identifier sub-option.





Bhandari, et al.         Expires April 30, 2015                 [Page 9]

Internet-Draft      ANI Options for DHCPv4 and DHCPv6       October 2014


   Length (1-Octet)
      Total length of this sub option, excluding the suboption code and
      length fields.

   Operator Enterprise ID (4-Octets)
      Vendor ID as a four octet Private Enterprise Number [SMI].

4.4.2.  DHCPv4 Operator Realm sub-option




       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      | suboptioncode |     Length    |                               ~
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      ~                        Operator Realm                         ~
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   SubOption Code (8 bits)
      8 bit code.  It should be set to value of <IANA-6> , indicating
      that it is Operator-Realm sub-option.

   Length (1 octet)
      Total length of this sub option, excluding the suboption code and
      length fields.

   Operator Realm (Variable Length)
      Realm of the operator.  Realm names are required to be unique, and
      are piggybacked on the administration of the DNS namespace.
      Realms are encoded using a domain name encoding defined in
      [RFC1035].  Up to (253) octets of the operator realm.


5.  DHCPv6 Access-Network-Identifier options

   The Access Network Identifier option defined here will be added by
   DHCPv6 client in upstream DHCPv6 messages or by the Relay in Relay-
   forward messages.










Bhandari, et al.         Expires April 30, 2015                [Page 10]

Internet-Draft      ANI Options for DHCPv4 and DHCPv6       October 2014


   +================+========================================+
   |    OPTION CODE |      OPTION  DESCRIPTION               |
   +================+========================================+
   |    <IANA-7>    | OPTION_ANI_ATT                         |
   +=========================================================+
   |    <IANA-8>    | OPTION_ANI_NETWORK_NAME                |
   +=========================================================+
   |    <IANA-9>    | OPTION_ANI_AP_NAME                     |
   +=========================================================+
   |    <IANA-10>   | OPTION_ANI_AP_BSSID                    |
   +=========================================================+
   |    <IANA-11>   | OPTION_ANI_OPERATOR_ID                 |
   +=========================================================+
   |    <IANA-12>   | OPTION_ANI_OPERATOR_REALM              |
   +=========================================================+



5.1.  DHCPv6 Access-Network-Type option

   This option is used for exchanging the type of the access technology
   the client is attached to the network.  Its format is as follows:



        0                   1                   2                   3
        0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |       Option Code             |            OptLen             |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |  Access Technology Type (ATT) |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   option-code (16-bits)
      16-bit code OPTION_ANI_ATT <IANA-7>

   option-length (16-bits)
      16-bit unsigned integer indicating length in octets of this
      option.  The value must be set to (1).

   Access Technology Type (ATT):
      Content of this is same as ATT field described in Section 4.2.








Bhandari, et al.         Expires April 30, 2015                [Page 11]

Internet-Draft      ANI Options for DHCPv4 and DHCPv6       October 2014


5.2.  DHCPv6 Network-Identifier options

   These options can be used for carrying the name of the access network
   (e.g., a SSID in case of IEEE 802.11 Access Network, or PLMN
   Identifier [TS23003] in case of 3GPP access ) and Access Point name,
   to which the client is attached.  The format of these options is
   defined below.

5.2.1.  DHCPv6 Network Name option



       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |       option-code             |       option-length           |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                     Network Name (e.g., SSID or PLMNID)       ~
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   option-code (16-bits)
      16-bit code OPTION_ANI_NETWORK_NAME <IANA-8>

   option-length (16-bits)
      16-bit unsigned integer indicating length in octets of this
      option.The value can be in the range of 2 to 32 octets.

   Network Name (Variable Length)
      Content of this field is same as Network Name field described in
      Section 4.3.1.

5.2.2.  DHCPv6 Access-Point Name option



       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |       option-code             |       option-length           |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                        Access-Point Name                      ~
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+








Bhandari, et al.         Expires April 30, 2015                [Page 12]

Internet-Draft      ANI Options for DHCPv4 and DHCPv6       October 2014


   option-code (16-bits)
      16-bit code OPTION_ANI_AP_NAME <IANA-9>

   option-length (16-bits)
      16-bit unsigned integer indicating length in octets of this
      option.The value can be in the range of 2 to 32 octets.

   Access-Point Name (Variable Length)
      Content of this field is same as described in Access-Point Name
      described in Section 4.3.2.

5.2.3.  DHCPv6 Access-Point BSSID option



       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |       option-code (TBD3)      |        option-length          |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                        Access-Point BSSID                     ~
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   option-code (16-bits)
      16-bit code OPTION_ANI_AP_BSSID <IANA-10>

   option-length (16-bits)
      16-bit unsigned integer indicating length in octets of this
      option.The value is set to 6.

   Access-Point BSSID (Variable Length)
      Content of this field is same as described in Access-Point BSSID
      described in Section 4.3.3.

5.3.  Operator identifier options

   The Operator identifier options can be used for carrying the operator
   identifier of the access network to which the client is attached.
   The format of these options is defined below.

5.3.1.  Operator Enterprise ID option










Bhandari, et al.         Expires April 30, 2015                [Page 13]

Internet-Draft      ANI Options for DHCPv4 and DHCPv6       October 2014


       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |       option-code             |        option-length          |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                Operator Enterprise ID                         |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   option-code (16-bits)
      16-bit code OPTION_ANI_OPERATOR_ID <IANA-11>

   option-length (16-bits)
      16-bit unsigned integer indicating length in octets of this
      option.

   AOperator Enterprise ID
      Content of this is same as Operator Enterprise ID field described
      in Section 4.4.1.

5.3.2.  Operator Realm option



       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |       option-code             |        option-length          |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      ~                       Operator Realm                          ~
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   option-code (16-bits)
      OPTION_ANI_OPERATOR_REALM <IANA-12>

   option-length (16-bits)
      16-bit unsigned integer indicating length in octets of this
      option.

   Operator Realm
      Content of this is same as Operator Realm field described in
      Section 4.4.2.








Bhandari, et al.         Expires April 30, 2015                [Page 14]

Internet-Draft      ANI Options for DHCPv4 and DHCPv6       October 2014


6.  Client Behavior

   DHCPv4 clients MAY include DHCPv4 ANI option define in Section 4
   including one or more sub-options within the option, as defined in
   sections 4.1 through 4.4 in all the upstream DHCPv4 messages to
   inform the receiver about the access network it is attached to.

   DHCPv6 clients MAY include DHCPv6 ANI options, as defined in Section
   5.


7.  Relay Agent Behavior

   DHCPv4 Relay Agents MAY include sub-options defined in section 4.2
   through 4.4 in the Relay Agent Information option as defined in
   [RFC3046] before forwarding the DHCP message to provide information
   about the access network over which DHCP messages from the client is
   received.  If the DHCPv4 relay agent receives DHCPv4 message already
   containing access network identifier sub-options within option 82
   based on its configured policy it MAY overwrite the sub-options.
   DHCPv4 Relay agent MAY include the sub-options in Relay Agent
   Information option even if the DHCPv4 ANI option is inserted by the
   DHCPv4 client in the received DHCPv4 message based on its configured
   policy.

   DHCPv6 Relay Agents MAY include options defined in Section 5 in
   Relay-forward message when forwarding packets from clients to the
   servers to provide information about the access network over which
   DHCPv6 messages from the client is received.  DHCPv6 Relay Agent MAY
   include options defined in Section 5 in Relay-forward message even if
   the same options have been included by the DHCPv6 client in the
   received DHCPv6 message based on its configured policy.


8.  Server Behavior

   If DHCPv4 server does not understand the option defined in Section 4
   it MUST ignore the DHCPv4 Access Network Identifier option received.
   If the DHCPv4 server does not understand the received sub-option
   defined in sections 4.1 through 4.4 either in DHCPv4 Access Network
   Identifier option or in Relay Agent Information options it MUST
   ignore those sub-options only.  If DHCPv4 Server is able to process
   the DHCPv4 Access Network Identifier and sub-options defined in
   sections 4.1 through 4.4 received in DHCPv4 Access Network Identifier
   or Relay Agent Information option it MAY use it for address pool
   selection policy decisions as per its configured policy.  DHCPv4
   server MAY store this information along with the lease for logging
   and audit purpose.  DHCPv4 server MAY use the sub-options defined in



Bhandari, et al.         Expires April 30, 2015                [Page 15]

Internet-Draft      ANI Options for DHCPv4 and DHCPv6       October 2014


   sections 4.1 through section 4.4 inserted by the DHCPv4 client in
   DHCPv4 Access Network Identifier option or by DHCPv4 relay agent in
   Relay Agent Information option based on its configured policy.

   If the DHCPv6 server receives the options defined in Section 5 and is
   configured to store or use the options defined in Section 5, it
   SHOULD look for the DHCPv6 Access Network identifier options in the
   Relay-Forward DHCP message of the DHCPv6 relay agent(s) or from the
   DHCPv6 client based on its configured policy.


9.  IANA Considerations

   This document defines DHCPv4 Access Network Identifier option which
   requires assignment of DHCPv4 option code TBD1 assigned from "BOOTP
   Vendor Extensions and DHCP Options" registry <http://www.iana.org/
   assignments/bootp-dhcp-parameters/bootp-dhcp-parameters.xml>, as
   specified in [RFC2939].

   IANA is requested to assign Sub-option codes for the following DHCPv4
   Sub-options from the "DHCP Relay Agent Sub-Option Codes"



   +================+========================================+
   | SUBOPTION CODE |      SUBOPTION  DESCRIPTION            |
   +================+========================================+
   |    <IANA-1>    | Access Technology Type Suboption       |
   +=========================================================+
   |    <IANA-2>    | Access Network Name Suboption          |
   +=========================================================+
   |    <IANA-3>    | Access Point Name Suboption            |
   +=========================================================+
   |    <IANA-4>    | Access Point BSSID Sub-option          |
   +=========================================================+
   |    <IANA-5>    | Operator-Identifier Sub-option         |
   +=========================================================+
   |    <IANA-6>    | Operator-Realm Sub-option              |
   +=========================================================+


   IANA is requested to assign option codes for the following DHCPv6
   options from the "Option Codes registry for DHCPv6" registry <http://
   www.iana.org/assignments/dhcpv6-parameters/dhcpv6-parameters.xml>, as
   specified.






Bhandari, et al.         Expires April 30, 2015                [Page 16]

Internet-Draft      ANI Options for DHCPv4 and DHCPv6       October 2014


   +================+========================================+
   |   OPTION CODE  |      OPTION  DESCRIPTION               |
   +================+========================================+
   |    <IANA-7>    | OPTION_ANI_ATT                         |
   +=========================================================+
   |    <IANA-8>    | OPTION_ANI_NETWORK_NAME                |
   +=========================================================+
   |    <IANA-9>    | OPTION_ANI_AP_NAME                     |
   +=========================================================+
   |    <IANA-10>   | OPTION_ANI_AP_BSSID                    |
   +=========================================================+
   |    <IANA-11>   | OPTION_ANI_OPERATOR_ID                 |
   +=========================================================+
   |    <IANA-12>   | OPTION_ANI_OPERATOR_REALM              |
   +=========================================================+




10.  Security Considerations

   Since there is no privacy protection for DHCP messages, an
   eavesdropper who can monitor the link between the DHCP server, relay
   agent and client can discover access network information.

   To minimize the unintended exposure of this information, this option
   SHOULD be included by DHCP entities only when it is configured.
   Where critical decisions might be based on the value of this option,
   DHCP authentication as defined in "Authentication for DHCP Messages"
   [RFC3118] and "Dynamic Host Configuration Protocol for IPv6 (DHCPv6)"
   [RFC3315] SHOULD be used to protect the integrity of the DHCP
   options.  Link-layer confidentiality and integrity protection may
   also be employed to reduce the risk of disclosure and tampering.

   Security issues related DHCPv6 are described in section 23 of
   [RFC3315].

   DHCP clients can fake its Access Network Identifier option values to
   gain better service.  DHCP Servers and Relay agents should be
   configured with suitable policy to override or trust the access
   network information received from DHCP clients.

   It is possible for a rogue DHCP relay agent to insert or overwrite
   with incorrect access network identifier options for malicious
   purposes.  A DHCP client can also pose as a rogue DHCP relay agent by
   sending incorrect access network identifier options.  While the
   introduction of fraudulent DHCP relay agent information options can
   be prevented by a perimeter defense that blocks these options unless



Bhandari, et al.         Expires April 30, 2015                [Page 17]

Internet-Draft      ANI Options for DHCPv4 and DHCPv6       October 2014


   the DHCP relay agent is trusted, a deeper defense using the
   authentication suboption for DHCPv4 relay agent information option
   [RFC4030] SHOULD be deployed as well.  DHCP server administrators are
   strongly advised to configure DHCP servers that use this option to
   communicate with their relay agents using IPsec, as described in
   Section 21.1 of [RFC3315].


11.  Acknowledgements

   The authors would like to thank Kim Kinnear, Ted Lemon, Gaurav
   Halwasia, Bernie Volz, Tomek Mrugalski, Hidetoshi Yokota and Sheng
   Jiang for their valuable inputs.


12.  References

12.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC2131]  Droms, R., "Dynamic Host Configuration Protocol",
              RFC 2131, March 1997.

   [RFC3046]  Patrick, M., "DHCP Relay Agent Information Option",
              RFC 3046, January 2001.

   [RFC3315]  Droms, R., Bound, J., Volz, B., Lemon, T., Perkins, C.,
              and M. Carney, "Dynamic Host Configuration Protocol for
              IPv6 (DHCPv6)", RFC 3315, July 2003.

12.2.  Informative References

   [ANI]      "Interoperability Specification (IOS) for High Rate Packet
              Data (HRPD) Radio Access Network Interfaces with Session
              Control in the Access Network, A.S0008-A v3.0",
              October 2008.

   [RFC1035]  Mockapetris, P., "Domain names - implementation and
              specification", STD 13, RFC 1035, November 1987.

   [RFC2939]  Droms, R., "Procedures and IANA Guidelines for Definition
              of New DHCP Options and Message Types", BCP 43, RFC 2939,
              September 2000.

   [RFC3118]  Droms, R. and W. Arbaugh, "Authentication for DHCP
              Messages", RFC 3118, June 2001.



Bhandari, et al.         Expires April 30, 2015                [Page 18]

Internet-Draft      ANI Options for DHCPv4 and DHCPv6       October 2014


   [RFC4030]  Stapp, M. and T. Lemon, "The Authentication Suboption for
              the Dynamic Host Configuration Protocol (DHCP) Relay Agent
              Option", RFC 4030, March 2005.

   [RFC5213]  Gundavelli, S., Leung, K., Devarapalli, V., Chowdhury, K.,
              and B. Patil, "Proxy Mobile IPv6", RFC 5213, August 2008.

   [RFC5844]  Wakikawa, R. and S. Gundavelli, "IPv4 Support for Proxy
              Mobile IPv6", RFC 5844, May 2010.

   [RFC6757]  Gundavelli, S., Korhonen, J., Grayson, M., Leung, K., and
              R. Pazhyannur, "Access Network Identifier (ANI) Option for
              Proxy Mobile IPv6", RFC 6757, October 2012.

   [SMI]      "PRIVATE ENTERPRISE NUMBERS, SMI Network Management
              Private Enterprise Codes", February  2011.

   [TS23003]  "Numbering, addressing and identification", 2011.

   [TS23203]  "Policy and Charging Control Architecture", 2012.

   [TS23402]  "Architecture enhancements for non-3GPP accesses", 2012.


Authors' Addresses

   Shwetha Bhandari
   Cisco Systems
   Cessna Business Park, Sarjapura Marathalli Outer Ring Road
   Bangalore, KARNATAKA  560 087
   India

   Phone: +91 80 4426 0474
   Email: shwethab@cisco.com


   Sri Gundavelli
   Cisco Systems
   170 West Tasman Drive
   San Jose, CA  95134
   USA

   Email: sgundave@cisco.com








Bhandari, et al.         Expires April 30, 2015                [Page 19]

Internet-Draft      ANI Options for DHCPv4 and DHCPv6       October 2014


   Jouni Korhonen
   Renesas Mobile
   Linnoitustie 6
   FIN-02600 Espoo,
   Finland

   Phone:
   Email: jouni.nospam@gmail.com


   Mark Grayson
   Cisco Systems
   11 New Square Park
   Bedfont Lakes, FELTHAM  TW14 8HA
   ENGLAND

   Email: mgrayson@cisco.com


































Bhandari, et al.         Expires April 30, 2015                [Page 20]

